app/controllers/calendar_controller.rb

	def index
		@user = User.find(params[:user_id])
		@user_id = current_user.id
		@user_appointments = Calendar.where(user_id: @user_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "calendars".* FROM "calendars" WHERE "calendars"."user_id" = $1  [["user_id", 2]]