app/controllers/meals_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "meals".* FROM "meals"
---
	def index
		@user = User.find(params[:user_id])
		@meal = Meal.all