app/controllers/workouts_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "exerciselists".* FROM "exerciselists" WHERE (muscle = 'quadriceps' or muscle = 'hamstrings' or muscle = 'calves' or muscle = 'glutes')
---
	def index
		@user = User.find(params[:user_id])
		@exerciselistbicep = Exerciselist.where(muscle: "biceps")